[
"Prompt 1: Ultra-clean monogram logo for a premium fintech startup — interlocking letters 'A' and 'V' (use as placeholder), perfect geometric proportions, negative space arrow integrated between the letters to imply growth, flat vector style for scalability, single-color primary and reversed white on dark, include gold foil mockup and embossed stationery mockup, deliver SVG-ready, 1:1 and horizontal variations.",
"Prompt 2: Aggressive eSports team emblem without text — stylized phoenix head with sharp angular beak and layered feather armor, high contrast dark gradient base with neon cyan rim lighting, metallic chrome highlights, subtle motion blur to convey speed, designed to read clearly at 64px and as large print, include one-color silhouette version.",
"Prompt 3: Luxury fashion house crest — symmetrical crest with ornate filigree, minimal Latin ribbon placeholder, central symbol: abstract rose formed from seamless curves, deep matte black background with spot-gloss and 24k gold foil treatments, tight kerning instructions for future wordmark, deliver scalable vector and mockups on leather and garment tags.",
"Prompt 4: Tech-startup glyph for mobile app icon — minimal geometric cube tilted in isometric view, internal circuitry pattern subtly visible within faces, soft gradient from electric indigo to violet, crisp rounded corners for app icon at 1024px, optimize for legibility at 48px, provide flat single-color variant and normal map for subtle 3D render.",
"Prompt 5: Healthcare clinic logo — clean, approachable emblem combining a stylized heart and cross made from a single continuous stroke, rounded corners, friendly palette (teal, soft coral), include instructions for accessible color contrast and high-contrast black/white version, vector and embroidery-friendly line weights.",
"Prompt 6: Minimalist architecture firm wordmark + symbol — stacked logotype in narrow sans with custom ligature between 'r' and 'c', symbol: thin-outline blueprint square with one corner folded, neutral charcoal primary palette, provide horizontal, stacked, and favicon versions, include grid alignment and minimum clearspace rules.",
"Prompt 7: Retro diner badge logo — circular badge, illustrated vintage chef character silhouette, warm palette (cream, cherry red, teal), halftone texture, distressed print effect option, flat decal variant for signage, provide layered PSD with smart objects for mockups.",
"Prompt 8: Environmental non-profit emblem — stylized leaf and river forming an infinity loop, organic hand-drawn strokes with clean vector trace, earthy color palette (forest green, river blue), include single-line monoline variant for stamps and single-color embroidery, include brand pattern tile made from leaf elements.",
"Prompt 9: High-tech cybersecurity logo — shield formed from interlocked hexagons, subtle lock negative space in center, deep navy and neon green accents, beveled metal look for hero usage, flat glyph for favicon and app usage, provide 1:1, 3:1 lockup and black/white variants.",
"Prompt 10: Playful children’s education brand — mascot: friendly geometric owl with large eyes, soft rounded shapes, pastel palette (sunny yellow, sky blue, mint), include simplified single-shape version for small sizes, ensure friendly proportions and vector outlines for vinyl stickers.",
"Prompt 11: Abstract geometric mark for creative agency — tessellated polygon that reads differently at varying sizes (umbrella shape at small scale, star at large), gradient mesh from magenta to orange, include responsive variants: detailed, simplified, monochrome, and favicon.",
"Prompt 12: Industrial manufacturing emblem — strong angular gear fused with a stylized lightning bolt, heavy slab type treatment optional, weathered metal texture for hero usage, flat industrial two-color variant for stenciling, ensure legible at large signage distances.",
"Prompt 13: Organic food brand — hand-drawn stamp logo: circle with wheat stalk and small barn silhouette, warm rustic palette, rough paper texture mockup and clean vector for packaging labels, include single-ink press proof version.",
"Prompt 14: Modern law firm wordmark — elegant serif with generous x-height, small geometric shield icon to left featuring balanced scales in negative space, monochrome black and a refined deep burgundy accent, produce reversible lockup and embroidery guidelines for lapel pins.",
"Prompt 15: Sportswear sub-brand — dynamic slash mark forming a letter 'S' (placeholder) with knitted textile pattern overlay, bold minimal colorways for tri-color printing, include vector version optimized for screen printing and rubber heat-press labels.",
"Prompt 16: Biotech startup logo — double-helix abstracted into a clean circle mark, glassy gradient with micro-spec texture, clinical blue and soft lime palette, include line art variant for journal footers and high-contrast black/white for academic posters.",
"Prompt 17: Vintage travel lodge badge — oval badge with mountain silhouette, sunrise rays and subtle rope border, muted retro palette (burnt orange, olive), include sew-on patch mockup and enamel pin simplified variant.",
"Prompt 18: Minimal icon set for smart home brand — 5 glyphs that share a consistent stroke width and geometric corner radius (power, thermostat, lock, light, camera), primary mark: home outline containing a stylized wave, provide SVG sprite and PNGs at common sizes with clear spacing rules.",
"Prompt 19: Progressive political campaign logo — strong sans wordmark with a rising bar mark forming a subtle checkmark, patriotic but modern palette (deep blue, warm red with neutral gray), flat and textured versions, include high-contrast and grayscale versions for newspapers.",
"Prompt 20: Restaurant logo — elegant emblem combining a fork and flame into a minimalist crest, warm charcoal and burnt orange, include embossed napkin and menu cover mockups, deliver vector with dieline for custom stamp.",
"Prompt 21: Retro-futuristic synthwave entertainment logo — neon outlined geometric letterform, subtle grid horizon behind, glowing bloom and lens flares, two-version set: full neon hero with glow and simplified one-color for print.",
"Prompt 22: Corporate sustainability seal — circular seal with three concentric rings, inner icon: stylized solar panel + leaf, flat green palette with a metallic bronze variant for awards and certificates, include SVG for reversible embossing on certificates.",
"Prompt 23: Luxury watchmaker monogram — intertwined letters in classic engraved style, deep navy with rose gold metal finish, delicate guilloché pattern background suggestion, provide vector for engraving and a high-res photorealistic 3D render for product mockups.",
"Prompt 24: Animal mascot logo for youth sports — bold cartoon badger head with confident expression, clean vector outlines, strong silhouette for patches, two-color school palette, include action pose and simplified headshot for social avatar.",
"Prompt 25: Abstract wave mark for creative podcast network — flowing continuous line forming a wave and microphone negative space, modern condensed sans for logotype, gradient cyan to turquoise with subtle grain for print, provide horizontal and stacked lockups.",
"Prompt 26: Minimal responsive airline mark — stylized wing made from three overlapping chevrons, cool slate and sky blue palette, highly simplified one-stroke variant for tail fin and favicon, include guidelines for scaling at 8m aircraft livery.",
"Prompt 27: Boutique coffee roaster — hand-lettered script wordmark accompanied by a simplified coffee bean crest, warm roastery palette (espresso brown, cream), include stamp variation for bags and single-color stencil for roasting equipment.",
"Prompt 28: Blockchain protocol symbol — crystalline node network forming a hexagonal emblem, deep space blue background with luminous cyan connections, line art for whitepapers and full-color dynamic render for key visuals, include minimal glyph for token icon.",
"Prompt 29: Minimal botanical monoline mark — single continuous line creating a stylized tulip, ultra-thin stroke for premium stationery, include thicker monoline variant for signage and embossing, pastel green primary and gold effect option.",
"Prompt 30: Children's toy brand — chunky rounded logotype paired with a smiling robot character built from geometric blocks, vibrant primary colors, ensure high legibility at 32px and toy mold friendly outlines for plastic molding.",
"Prompt 31: High-contrast stamp logo for postal service startup — square stamp with perforated edge treatment and a bold, simple emblem (paper plane in negative space), two-color-only for economical printing, provide halftone and single-ink options.",
"Prompt 32: Artisanal brewery — heraldic badge with hop cone stylized like a pinecone, textured ink print effect, subdued amber and forest palette, include circular coasters and tap handle simplified iconography.",
"Prompt 33: Clean, techy SaaS mark — floating ring around a dot representing cloud orbiting data point, gradient from azure to teal, flat single-stroke glyph for tiny favicons, include UI icon grid and color accessibility notes.",
"Prompt 34: Photorealistic metallic automotive badge — 3D chrome emblem shaped like an abstract cheetah in motion, brushed metal and glossy lacquer materials, include lighting rig notes for photoreal render and simplified flat decal version for vinyl.",
"Prompt 35: Cultural festival logo — vibrant mosaic of geometric tiles forming a dancing figure, multi-color palette with cultural motif accents, include Vector-tile pattern for banners and a one-color silhouette for merch.",
"Prompt 36: Yoga & wellness studio — calming mandala formed from overlapping leaves and hands, soft gradient (sage to blush), simple icon for app and social, include instructions for scaled stroke weights and print-friendly single-color variant.",
"Prompt 37: Contemporary jewelry brand — minimal diamond outline with asymmetric bevel, black on white and rose-gold foil mockups, deliver vector with micro-details for laser etching and scaled favicon.",
"Prompt 38: Food truck logo — gritty hand-drawn grill mascot with smoke ribbons forming type baseline, bright punchy colors, include trailer wrap guidance and simplified sticker version.",
"Prompt 39: Startup incubator emblem — ascending staircase of abstract blocks inside a square, optimistic orange and slate gray palette, modular logo system with submarks for divisions, include lockup rules for partner co-branding.",
"Prompt 40: Modern university department seal — circular academic seal reinterpreted with clean sans and minimalist crest, include small type for founding year, two variants: formal engraving style and modern flat emblem for web.",
"Prompt 41: Photography studio watermark — compact signature mark combining aperture blades and a stylized 'P' placeholder, thin elegant strokes, monochrome only for watermarking, ensure non-obtrusive at varying opacities.",
"Prompt 42: Gaming accessory brand wordmark — aggressive condensed display type with dynamic slashes, icon: angular controller silhouette integrated into negative space, dark matte finish with electric accent, single-color pad print friendly variant.",
"Prompt 43: Local craft market logo — friendly badge using hand-cut paper collage aesthetic, warm primary palette, includes repeating pattern tile for bags, ensure reduced-detail variant for small tags.",
"Prompt 44: Solar energy company — rising sun formed from segmenting photovoltaic panels, bright warm yellow and clean gray, flat and embossed variants for signage, include minimum clearspace and minimum size guidelines.",
"Prompt 45: AI research lab mark — stylized neuron node map flowing into a minimal brain silhouette, cool steel and teal palette, line art for papers and complex 3D visual for hero, provide single-stroke icon for small sizes.",
"Prompt 46: Minimal beer label crest — circular badge with single hop petal motif and numeric year, distressed print option and clean vector for digital labels, include die-cut sticker version.",
"Prompt 47: High-end barber shop emblem — vintage straight razor crossed with shears inside a diamond badge, black, cream and muted gold, engraved metal sign mockup and simple stamped variant for receipts.",
"Prompt 48: Delivery logistics brand — stylized van formed from a single continuous stroke that implies motion, bold sans logotype, high-visibility orange and deep gray palette, include single-color decal and vehicle wrap considerations.",
"Prompt 49: Educational toy maker — geometric puzzle piece mascot with smiling face, bright approachable colors, ensure toy-safe outlines and moldable silhouette for 3D manufacturing, include SVG and PNG sprites.",
"Prompt 50: Premium perfume label mark — delicate emblem combining a teardrop perfume bottle and laurel wreath, soft champagne and charcoal palette, gold foil and deboss options for bottles, include minimal monogram variant for caps."
]
